//
//  MCCountryUtils.m
//  MotionCamera
//
//  Created by 原鹏飞 on 2019/10/10.
//  Copyright © 2019 Apeman. All rights reserved.
//

#import "MCCountryUtils.h"
#import <CoreTelephony/CTCarrier.h>
#import <CoreTelephony/CTTelephonyNetworkInfo.h>

@implementation MCCountryUtils

+ (int)localTimeZone {
    return (int)([[NSTimeZone localTimeZone] secondsFromGMT] / (60 * 60));
}

+ (int)timeZoneIndex:(NSTimeZone *)zone {
    if (zone) {
        return (int)([zone secondsFromGMT] / (60 * 60));
    }
    return 0;
}

+ (NSArray<MCCountryItem *> *)getDefaultCountryList {
    NSMutableArray * list = [[NSMutableArray alloc] init];
    
    for (NSDictionary *dict in [self getDefaultPhoneCodeList]) {
        MCCountryItem * item = [[MCCountryItem alloc] init];
        if ([[dict allKeys] containsObject:@"a"]) {
            item.area = dict[@"a"];
        }
        
        if ([[dict allKeys] containsObject:@"c"]) {
            item.code = dict[@"c"];
        }
        
        if ([[dict allKeys] containsObject:@"n"]) {
            item.name = dict[@"n"];
        }
        
        if ([[dict allKeys] containsObject:@"r"]) {
            item.remark = dict[@"r"];
        }
        
        [list addObject:item];
    }
    
    return list;
}

+ (MCCountryItem *)getDefaultMCCountryItem {
    //First step: get device info.
    NSString *ISOcountryCode;
    
    CTTelephonyNetworkInfo *network_Info = [CTTelephonyNetworkInfo new];
    CTCarrier *carrier = network_Info.subscriberCellularProvider;
    ISOcountryCode = carrier.isoCountryCode;
    
    if (ISOcountryCode.length == 0) {
        NSLocale *locale = [NSLocale currentLocale];
        ISOcountryCode = [locale objectForKey:NSLocaleCountryCode];
    }
    
    ISOcountryCode = [ISOcountryCode uppercaseString];
    MCCountryItem * item = [[MCCountryItem alloc] init];
    NSArray *countryCodeList = [MCCountryUtils getDefaultPhoneCodeList];
    for (NSDictionary *dict in countryCodeList) {
        if ([[dict objectForKey:@"a"] isEqualToString:ISOcountryCode]) {
            if ([[dict allKeys] containsObject:@"a"]) {
                item.area = dict[@"a"];
            }
            
            if ([[dict allKeys] containsObject:@"c"]) {
                item.code = dict[@"c"];
            }
            
            if ([[dict allKeys] containsObject:@"n"]) {
                item.name = dict[@"n"];
            }
            
            if ([[dict allKeys] containsObject:@"r"]) {
                item.remark = dict[@"r"];
            }
        }
    }
    return item;
}

+ (NSString *)getDefaultCountryCode {
    //First step: get device info.
    NSString *ISOcountryCode;
    
    CTTelephonyNetworkInfo *network_Info = [CTTelephonyNetworkInfo new];
    CTCarrier *carrier = network_Info.subscriberCellularProvider;
    ISOcountryCode = carrier.isoCountryCode;
    
    if (ISOcountryCode.length == 0) {
        NSLocale *locale = [NSLocale currentLocale];
        ISOcountryCode = [locale objectForKey:NSLocaleCountryCode];
    }
    
    ISOcountryCode = [ISOcountryCode uppercaseString];
    
    //Second step: get area code by ISOcountryCode.
    NSString *code = @"";
    NSArray *countryCodeList = [MCCountryUtils getDefaultPhoneCodeList];
    for (NSDictionary *dict in countryCodeList) {
        if ([[dict objectForKey:@"a"] isEqualToString:ISOcountryCode]) {
            code = dict[@"c"];
        }
    }
    return code;
}

+ (NSArray *)getDefaultPhoneCodeList {
    BOOL isChinese = [MCCountryUtils isChinese];
    if (isChinese) {
        return @[@{@"a":@"AF", @"c":@"93", @"n":@"阿富汗"},
                 @{@"a":@"AL", @"c":@"355", @"n":@"阿尔巴尼亚"},
                 @{@"a":@"DZ", @"c":@"213", @"n":@"阿尔及利亚"},
                 @{@"a":@"AD", @"c":@"376", @"n":@"安道尔共和国"},
                 @{@"a":@"AI", @"c":@"1254", @"n":@"安圭拉岛"},
                 @{@"a":@"AW", @"c":@"297", @"n":@"阿鲁巴"},
                 @{@"a":@"AO", @"c":@"244", @"n":@"安哥拉"},
                 @{@"a":@"AG", @"c":@"1268", @"n":@"安提瓜和巴布达"},
                 @{@"a":@"AR", @"c":@"54", @"n":@"阿根廷", @"r":@"AZ"},
                 @{@"a":@"AM", @"c":@"374", @"n":@"亚美尼亚"},
                 @{@"a":@"AU", @"c":@"61", @"n":@"澳大利亚", @"r":@"AZ"},
                 @{@"a":@"AT", @"c":@"43", @"n":@"奥地利"},
                 @{@"a":@"AX", @"c":@"358", @"n":@"奥兰群岛"},
                 @{@"a":@"AZ", @"c":@"994", @"n":@"阿塞拜疆"},
                 @{@"a":@"AC", @"c":@"247", @"n":@"阿森松岛"},
                 @{@"a":@"BS", @"c":@"1242", @"n":@"巴哈马"},
                 @{@"a":@"BH", @"c":@"973", @"n":@"巴林"},
                 @{@"a":@"BD", @"c":@"880", @"n":@"孟加拉国"},
                 @{@"a":@"BB", @"c":@"1246", @"n":@"巴巴多斯"},
                 @{@"a":@"BY", @"c":@"375", @"n":@"白俄罗斯"},
                 @{@"a":@"BE", @"c":@"32", @"n":@"比利时"},
                 @{@"a":@"BZ", @"c":@"501", @"n":@"伯利兹"},
                 @{@"a":@"BJ", @"c":@"229", @"n":@"贝宁"},
                 @{@"a":@"BM", @"c":@"1441", @"n":@"百慕大群岛"},
                 @{@"a":@"BT", @"c":@"975", @"n":@"不丹"},
                 @{@"a":@"BT", @"c":@"47", @"n":@"布韦岛"},
                 @{@"a":@"BO", @"c":@"591", @"n":@"玻利维亚", @"r":@"AZ"},
                 @{@"a":@"BA", @"c":@"387", @"n":@"波斯尼亚和黑塞哥维那"},
                 @{@"a":@"BW", @"c":@"267", @"n":@"博茨瓦纳"},
                 @{@"a":@"BR", @"c":@"55", @"n":@"巴西", @"r":@"AZ"},
                 @{@"a":@"VG", @"c":@"1284", @"n":@"英属维京群岛"},
                 @{@"a":@"IO", @"c":@"246", @"n":@"英属印度洋领地"},
                 @{@"a":@"BN", @"c":@"673", @"n":@"文莱"},
                 @{@"a":@"BG", @"c":@"359", @"n":@"保加利亚"},
                 @{@"a":@"BF", @"c":@"226", @"n":@"布基纳法索"},
                 @{@"a":@"BI", @"c":@"257", @"n":@"布隆迪"},
                 @{@"a":@"KH", @"c":@"855", @"n":@"柬埔寨"},
                 @{@"a":@"CM", @"c":@"237", @"n":@"喀麦隆"},
                 @{@"a":@"CA", @"c":@"1", @"n":@"加拿大", @"r":@"AZ"},
                 @{@"a":@"CV", @"c":@"238", @"n":@"佛得角"},
                 @{@"a":@"FK", @"c":@"500", @"n":@"福克兰群岛"},
                 @{@"a":@"KY", @"c":@"1345", @"n":@"开曼群岛"},
                 @{@"a":@"CF", @"c":@"236", @"n":@"中非共和国"},
                 @{@"a":@"TD", @"c":@"235", @"n":@"乍得"},
                 @{@"a":@"CL", @"c":@"56", @"n":@"智利", @"r":@"AZ"},
                 @{@"a":@"CN", @"c":@"86", @"n":@"中国", @"r":@"AY"},
                 @{@"a":@"CO", @"c":@"57", @"n":@"哥伦比亚", @"r":@"AZ"},
                 @{@"a":@"KM", @"c":@"269", @"n":@"科摩罗"},
                 @{@"a":@"XK", @"c":@"383", @"n":@"科索沃"},
                 @{@"a":@"CC", @"c":@"61-891", @"n":@"科科斯(基林)群岛"},
                 @{@"a":@"FR", @"c":@"33", @"n":@"克利珀顿岛"},
                 @{@"a":@"CG", @"c":@"242", @"n":@"刚果(布)"},
                 @{@"a":@"CD", @"c":@"243", @"n":@"刚果(金)"},
                 @{@"a":@"CR", @"c":@"506", @"n":@"哥斯达黎加"},
                 @{@"a":@"HR", @"c":@"385", @"n":@"克罗地亚"},
                 @{@"a":@"CY", @"c":@"357", @"n":@"塞浦路斯"},
                 @{@"a":@"CZ", @"c":@"420", @"n":@"捷克共和国"},
                 @{@"a":@"DK", @"c":@"45", @"n":@"丹麦"},
                 @{@"a":@"CU", @"c":@"53", @"n":@"古巴"},
                 @{@"a":@"DJ", @"c":@"253", @"n":@"吉布提"},
                 @{@"a":@"DO", @"c":@"1809", @"n":@"多米尼加共和国"},
                 @{@"a":@"DM", @"c":@"1-767", @"n":@"多米尼克"},
                 @{@"a":@"EC", @"c":@"593", @"n":@"厄瓜多尔", @"r":@"AZ"},
                 @{@"a":@"EG", @"c":@"20", @"n":@"埃及"},
                 @{@"a":@"SV", @"c":@"503", @"n":@"萨尔瓦多"},
                 @{@"a":@"GQ", @"c":@"240", @"n":@"赤道几内亚"},
                 @{@"a":@"ER", @"c":@"291", @"n":@"厄立特里亚"},
                 @{@"a":@"EE", @"c":@"372", @"n":@"爱沙尼亚"},
                 @{@"a":@"FO", @"c":@"298", @"n":@"法罗群岛"},
                 @{@"a":@"ET", @"c":@"251", @"n":@"埃塞俄比亚"},
                 @{@"a":@"FJ", @"c":@"679", @"n":@"斐济"},
                 @{@"a":@"CK", @"c":@"682", @"n":@"库克群岛"},
                 @{@"a":@"CW", @"c":@"599-9", @"n":@"库拉索"},
                 @{@"a":@"FI", @"c":@"358", @"n":@"芬兰"},
                 @{@"a":@"FR", @"c":@"33", @"n":@"法国"},
                 @{@"a":@"GF", @"c":@"594", @"n":@"法属圭亚那"},
                 @{@"a":@"PF", @"c":@"689", @"n":@"法属玻利尼西亚"},
                 @{@"a":@"TF", @"c":@"33", @"n":@"法属南部领地"},
                 @{@"a":@"GA", @"c":@"241", @"n":@"加蓬"},
                 @{@"a":@"GM", @"c":@"220", @"n":@"冈比亚"},
                 @{@"a":@"GE", @"c":@"995", @"n":@"格鲁吉亚"},
                 @{@"a":@"DE", @"c":@"49", @"n":@"德国"},
                 @{@"a":@"GH", @"c":@"233", @"n":@"加纳"},
                 @{@"a":@"ES", @"c":@"34", @"n":@"加纳利群岛"},
                 @{@"a":@"GI", @"c":@"350", @"n":@"直布罗陀"},
                 @{@"a":@"GR", @"c":@"30", @"n":@"希腊"},
                 @{@"a":@"GD", @"c":@"1809", @"n":@"格林纳达"},
                 @{@"a":@"GU", @"c":@"1671", @"n":@"关岛"},
                 @{@"a":@"GL", @"c":@"299", @"n":@"格陵兰"},
                 @{@"a":@"GP", @"c":@"590", @"n":@"瓜德罗普"},
                 @{@"a":@"GT", @"c":@"502", @"n":@"危地马拉", @"r":@"AZ"},
                 @{@"a":@"GN", @"c":@"224", @"n":@"几内亚"},
                 @{@"a":@"GW", @"c":@"245", @"n":@"几内亚比绍"},
                 @{@"a":@"GY", @"c":@"592", @"n":@"圭亚那"},
                 @{@"a":@"HT", @"c":@"509", @"n":@"海地"},
                 @{@"a":@"HN", @"c":@"504", @"n":@"洪都拉斯"},
                 @{@"a":@"HK", @"c":@"852", @"n":@"中国香港特别行政区", @"r":@"AZ"},
                 @{@"a":@"HU", @"c":@"36", @"n":@"匈牙利"},
                 @{@"a":@"EA", @"c":@"952", @"n":@"休达及梅利利亚"},
                 @{@"a":@"IS", @"c":@"354", @"n":@"冰岛"},
                 @{@"a":@"IN", @"c":@"91", @"n":@"印度"},
                 @{@"a":@"ID", @"c":@"62", @"n":@"印度尼西亚", @"r":@"AZ"},
                 @{@"a":@"IR", @"c":@"98", @"n":@"伊朗"},
                 @{@"a":@"IQ", @"c":@"964", @"n":@"伊拉克"},
                 @{@"a":@"IE", @"c":@"353", @"n":@"爱尔兰"},
                 @{@"a":@"IM", @"c":@"44", @"n":@"马恩岛"},
                 @{@"a":@"IL", @"c":@"972", @"n":@"以色列"},
                 @{@"a":@"IT", @"c":@"39", @"n":@"意大利", @"r":@"AZ"},
                 @{@"a":@"CI", @"c":@"225", @"n":@"科特迪瓦"},
                 @{@"a":@"JM", @"c":@"1876", @"n":@"牙买加"},
                 @{@"a":@"FM", @"c":@"691", @"n":@"密克罗尼西亚"},
                 @{@"a":@"JP", @"c":@"81", @"n":@"日本", @"r":@"AZ"},
                 @{@"a":@"JO", @"c":@"962", @"n":@"约旦"},
                 @{@"a":@"KZ", @"c":@"327", @"n":@"哈萨克斯坦"},
                 @{@"a":@"KZ", @"c":@"7", @"n":@"俄罗斯"},
                 @{@"a":@"KE", @"c":@"254", @"n":@"肯尼亚"},
                 @{@"a":@"KR", @"c":@"82", @"n":@"韩国", @"r":@"AZ"},
                 @{@"a":@"HM", @"c":@"672", @"n":@"赫德岛和麦克唐纳群岛"},
                 @{@"a":@"KW", @"c":@"965", @"n":@"科威特"},
                 @{@"a":@"KG", @"c":@"996", @"n":@"吉尔吉斯斯坦"},
                 @{@"a":@"KI", @"c":@"686", @"n":@"基里巴斯"},
                 @{@"a":@"LA", @"c":@"856", @"n":@"老挝"},
                 @{@"a":@"LV", @"c":@"371", @"n":@"拉脱维亚"},
                 @{@"a":@"LB", @"c":@"961", @"n":@"黎巴嫩"},
                 @{@"a":@"LS", @"c":@"266", @"n":@"莱索托"},
                 @{@"a":@"LR", @"c":@"231", @"n":@"利比里亚"},
                 @{@"a":@"LY", @"c":@"218", @"n":@"利比亚"},
                 @{@"a":@"LT", @"c":@"370", @"n":@"立陶宛"},
                 @{@"a":@"LI", @"c":@"423", @"n":@"列支敦士登"},
                 @{@"a":@"LU", @"c":@"352", @"n":@"卢森堡"},
                 @{@"a":@"MO", @"c":@"853", @"n":@"中国澳门特别行政区", @"r":@"AZ"},
                 @{@"a":@"MK", @"c":@"389", @"n":@"马其顿"},
                 @{@"a":@"MG", @"c":@"261", @"n":@"马达加斯加"},
                 @{@"a":@"MW", @"c":@"265", @"n":@"马拉维"},
                 @{@"a":@"MY", @"c":@"60", @"n":@"马来西亚", @"r":@"AZ"},
                 @{@"a":@"MV", @"c":@"960", @"n":@"马尔代夫"},
                 @{@"a":@"ML", @"c":@"223", @"n":@"马里"},
                 @{@"a":@"MT", @"c":@"356", @"n":@"马耳他"},
                 @{@"a":@"MH", @"c":@"692", @"n":@"马绍尔群岛"},
                 @{@"a":@"MA", @"c":@"1670", @"n":@"马里亚那群岛"},
                 @{@"a":@"MQ", @"c":@"596", @"n":@"马提尼克"},
                 @{@"a":@"MR", @"c":@"222", @"n":@"毛利塔尼亚"},
                 @{@"a":@"MU", @"c":@"230", @"n":@"毛里求斯"},
                 @{@"a":@"MX", @"c":@"52", @"n":@"墨西哥", @"r":@"AZ"},
                 @{@"a":@"MD", @"c":@"373", @"n":@"摩尔多瓦"},
                 @{@"a":@"MC", @"c":@"377", @"n":@"摩纳哥"},
                 @{@"a":@"MN", @"c":@"976", @"n":@"蒙古"},
                 @{@"a":@"MI", @"c":@"1664", @"n":@"蒙特塞拉特岛"},
                 @{@"a":@"ME", @"c":@"382", @"n":@"黑山共和国"},
                 @{@"a":@"MA", @"c":@"212", @"n":@"摩洛哥"},
                 @{@"a":@"MZ", @"c":@"258", @"n":@"莫桑比克"},
                 @{@"a":@"MM", @"c":@"95", @"n":@"缅甸", @"r":@"AZ"},
                 @{@"a":@"NA", @"c":@"264", @"n":@"纳米比亚"},
                 @{@"a":@"NP", @"c":@"977", @"n":@"尼泊尔"},
                 @{@"a":@"NR", @"c":@"674", @"n":@"瑙鲁"},
                 @{@"a":@"NE", @"c":@"599", @"n":@"荷属安的列斯"},
                 @{@"a":@"BQ", @"c":@"599", @"n":@"荷属加勒比区"},
                 @{@"a":@"SX", @"c":@"1-721", @"n":@"荷属加圣马丁"},
                 @{@"a":@"NL", @"c":@"31", @"n":@"荷兰"},
                 @{@"a":@"NZ", @"c":@"64", @"n":@"新西兰", @"r":@"AZ"},
                 @{@"a":@"NI", @"c":@"505", @"n":@"尼加拉瓜", @"r":@"AZ"},
                 @{@"a":@"NE", @"c":@"227", @"n":@"尼日尔"},
                 @{@"a":@"NU", @"c":@"683", @"n":@"纽埃"},
                 @{@"a":@"NG", @"c":@"234", @"n":@"尼日利亚"},
                 @{@"a":@"KP", @"c":@"850", @"n":@"朝鲜"},
                 @{@"a":@"NO", @"c":@"47", @"n":@"挪威"},
                 @{@"a":@"OM", @"c":@"968", @"n":@"阿曼"},
                 @{@"a":@"PK", @"c":@"92", @"n":@"巴基斯坦"},
                 @{@"a":@"PA", @"c":@"507", @"n":@"巴拿马"},
                 @{@"a":@"PG", @"c":@"675", @"n":@"巴布亚新几内亚"},
                 @{@"a":@"PS", @"c":@"970", @"n":@"巴勒斯坦领土"},
                 @{@"a":@"PY", @"c":@"595", @"n":@"巴拉圭", @"r":@"AZ"},
                 @{@"a":@"PE", @"c":@"51", @"n":@"秘鲁", @"r":@"AZ"},
                 @{@"a":@"PH", @"c":@"63", @"n":@"菲律宾", @"r":@"AZ"},
                 @{@"a":@"PL", @"c":@"48", @"n":@"波兰"},
                 @{@"a":@"PT", @"c":@"351", @"n":@"葡萄牙"},
                 @{@"a":@"PR", @"c":@"1787", @"n":@"波多黎各", @"r":@"AZ"},
                 @{@"a":@"QA", @"c":@"974", @"n":@"卡塔尔"},
                 @{@"a":@"RE", @"c":@"262", @"n":@"马约特"},
                 @{@"a":@"RE", @"c":@"262", @"n":@"留尼旺"},
                 @{@"a":@"RO", @"c":@"40", @"n":@"罗马尼亚"},
                 @{@"a":@"RU", @"c":@"7", @"n":@"俄罗斯"},
                 @{@"a":@"LC", @"c":@"1758", @"n":@"圣卢西亚"},
                 @{@"a":@"SV", @"c":@"1784", @"n":@"圣文森特岛"},
                 @{@"a":@"SE", @"c":@"684", @"n":@"东萨摩亚"},
                 @{@"a":@"TL", @"c":@"670", @"n":@"东帝汶"},
                 @{@"a":@"SW", @"c":@"685", @"n":@"西萨摩亚"},
                 @{@"a":@"RW", @"c":@"250", @"n":@"卢旺达"},
                 @{@"a":@"SM", @"c":@"378", @"n":@"圣马力诺"},
                 @{@"a":@"PM", @"c":@"508", @"n":@"圣皮埃尔和密克隆群岛"},
                 @{@"a":@"MF", @"c":@"1721", @"n":@"圣马丁岛"},
                 @{@"a":@"PW", @"c":@"680", @"n":@"帕劳"},
                 @{@"a":@"PN", @"c":@"64", @"n":@"皮特凯恩群岛"},
                 @{@"a":@"NF", @"c":@"672", @"n":@"诺福克岛"},
                 @{@"a":@"SA", @"c":@"966", @"n":@"沙特阿拉伯"},
                 @{@"a":@"GG", @"c":@"44-1481", @"n":@"格恩西岛"},
                 @{@"a":@"ST", @"c":@"239", @"n":@"圣多美和普林西比"},
                 @{@"a":@"BL", @"c":@"590", @"n":@"圣巴泰勒米"},
                 @{@"a":@"SH", @"c":@"290", @"n":@"圣赫勒拿"},
                 @{@"a":@"VC", @"c":@"1784", @"n":@"圣文森特和格林纳丁斯"},
                 @{@"a":@"KN", @"c":@"1869", @"n":@"圣基茨和尼维斯"},
                 @{@"a":@"CX", @"c":@"61", @"n":@"圣诞岛"},
                 @{@"a":@"SN", @"c":@"221", @"n":@"塞内加尔"},
                 @{@"a":@"SC", @"c":@"248", @"n":@"塞舌尔"},
                 @{@"a":@"RS", @"c":@"381", @"n":@"塞尔维亚"},
                 @{@"a":@"SL", @"c":@"232", @"n":@"塞拉利昂"},
                 @{@"a":@"SG", @"c":@"65", @"n":@"新加坡"},
                 @{@"a":@"NC", @"c":@"687", @"n":@"新喀里多尼亚"},
                 @{@"a":@"SK", @"c":@"421", @"n":@"斯洛伐克"},
                 @{@"a":@"SJ", @"c":@"47", @"n":@"斯瓦尔巴和扬马延"},
                 @{@"a":@"SI", @"c":@"386", @"n":@"斯洛文尼亚"},
                 @{@"a":@"SB", @"c":@"677", @"n":@"所罗门群岛"},
                 @{@"a":@"SO", @"c":@"252", @"n":@"索马里"},
                 @{@"a":@"ZA", @"c":@"27", @"n":@"南非"},
                 @{@"a":@"AQ", @"c":@"672", @"n":@"南极洲"},
                 @{@"a":@"SS", @"c":@"211", @"n":@"南苏丹"},
                 @{@"a":@"GS", @"c":@"500", @"n":@"南乔治亚和南桑威奇群岛"},
                 @{@"a":@"ES", @"c":@"34", @"n":@"西班牙"},
                 @{@"a":@"LK", @"c":@"94", @"n":@"斯里兰卡"},
                 @{@"a":@"SD", @"c":@"249", @"n":@"苏丹"},
                 @{@"a":@"SR", @"c":@"597", @"n":@"苏里南", @"r":@"AZ"},
                 @{@"a":@"SZ", @"c":@"268", @"n":@"斯威士兰"},
                 @{@"a":@"SE", @"c":@"46", @"n":@"瑞典"},
                 @{@"a":@"CH", @"c":@"41", @"n":@"瑞士"},
                 @{@"a":@"SY", @"c":@"963", @"n":@"叙利亚"},
                 @{@"a":@"TW", @"c":@"886", @"n":@"中国台湾", @"r":@"AZ"},
                 @{@"a":@"TJ", @"c":@"992", @"n":@"塔吉克斯坦"},
                 @{@"a":@"TZ", @"c":@"255", @"n":@"坦桑尼亚"},
                 @{@"a":@"TH", @"c":@"66", @"n":@"泰国", @"r":@"AZ"},
                 @{@"a":@"TG", @"c":@"228", @"n":@"多哥"},
                 @{@"a":@"TO", @"c":@"676", @"n":@"汤加"},
                 @{@"a":@"TT", @"c":@"1868", @"n":@"特立尼达和多巴哥"},
                 @{@"a":@"TA", @"c":@"290", @"n":@"特里斯坦-达库尼亚群岛"},
                 @{@"a":@"TC", @"c":@"1", @"n":@"特克斯和凯科斯群岛"},
                 @{@"a":@"TN", @"c":@"216", @"n":@"突尼斯"},
                 @{@"a":@"TV", @"c":@"688", @"n":@"图瓦卢"},
                 @{@"a":@"TR", @"c":@"90", @"n":@"土耳其"},
                 @{@"a":@"TK", @"c":@"690", @"n":@"托克劳"},
                 @{@"a":@"TM", @"c":@"993", @"n":@"土库曼斯坦"},
                 @{@"a":@"WF", @"c":@"681", @"n":@"瓦利斯和富图纳"},
                 @{@"a":@"VU", @"c":@"678", @"n":@"瓦努阿图"},
                 @{@"a":@"VI", @"c":@"1340", @"n":@"美属维尔京群岛"},
                 @{@"a":@"AS", @"c":@"1684", @"n":@"美属萨摩亚"},
                 @{@"a":@"UG", @"c":@"256", @"n":@"乌干达"},
                 @{@"a":@"UA", @"c":@"380", @"n":@"乌克兰"},
                 @{@"a":@"AE", @"c":@"971", @"n":@"阿拉伯联合酋长国"},
                 @{@"a":@"GB", @"c":@"44", @"n":@"英国"},
                 @{@"a":@"UM", @"c":@"246", @"n":@"美国本土外小岛屿"},
                 @{@"a":@"US", @"c":@"1", @"n":@"美国", @"r":@"AZ"},
                 @{@"a":@"UY", @"c":@"598", @"n":@"乌拉圭", @"r":@"AZ"},
                 @{@"a":@"UZ", @"c":@"998", @"n":@"乌兹别克斯坦"},
                 @{@"a":@"EH", @"c":@"212", @"n":@"西撒哈拉"},
                 @{@"a":@"VA", @"c":@"379", @"n":@"梵蒂冈城"},
                 @{@"a":@"VE", @"c":@"58", @"n":@"委内瑞拉", @"r":@"AZ"},
                 @{@"a":@"DG", @"c":@"246", @"n":@"迪戈加西亚岛"},
                 @{@"a":@"VN", @"c":@"84", @"n":@"越南", @"r":@"AZ"},
                 @{@"a":@"YE", @"c":@"967", @"n":@"也门"},
                 @{@"a":@"YU", @"c":@"381", @"n":@"南斯拉夫"},
                 @{@"a":@"ZM", @"c":@"260", @"n":@"赞比亚"},
                 @{@"a":@"JE", @"c":@"44", @"n":@"泽西岛"},
                 @{@"a":@"ZA", @"c":@"243", @"n":@"扎伊尔"},
                 @{@"a":@"ZW", @"c":@"263", @"n":@"津巴布韦"}];
    } else {
        return @[@{@"a":@"AF",@"c":@"93",@"n":@"Afghanistan"},
                 @{@"a":@"AL",@"c":@"355",@"n":@"Albania"},
                 @{@"a":@"AZ",@"c":@"358",@"n":@"Aland Islands"},
                 @{@"a":@"DZ",@"c":@"213",@"n":@"Algeria"},
                 @{@"a":@"AO",@"c":@"244",@"n":@"Angola"},
                 @{@"a":@"AS",@"c":@"1684",@"n":@"American Samoa"},
                 @{@"a":@"AN",@"c":@"376",@"n":@"Andorra"},
                 @{@"a":@"AW",@"c":@"297",@"n":@"Aruba"},
                 @{@"a":@"AR",@"c":@"54",@"n":@"Argentina",@"r":@"AZ"},
                 @{@"a":@"AM",@"c":@"374",@"n":@"Armenia"},
                 @{@"a":@"AM",@"c":@"1254",@"n":@"Anguilla"},
                 @{@"a":@"AU",@"c":@"61",@"n":@"Australia",@"r":@"AZ"},
                 @{@"a":@"AQ",@"c":@"672",@"n":@"Antarctica"},
                 @{@"a":@"AC",@"c":@"247",@"n":@"Ascension Island"},
                 @{@"a":@"AT",@"c":@"43",@"n":@"Austria"},
                 @{@"a":@"AG",@"c":@"1268",@"n":@"Antigua & Barbuda"},
                 @{@"a":@"AZ",@"c":@"994",@"n":@"Azerbaijan"},
                 @{@"a":@"BH",@"c":@"973",@"n":@"Bahrain"},
                 @{@"a":@"BB",@"c":@"1246",@"n":@"Barbados"},
                 @{@"a":@"BS",@"c":@"1242",@"n":@"Bahamas"},
                 @{@"a":@"BD",@"c":@"880",@"n":@"Bangladesh"},
                 @{@"a":@"BY",@"c":@"375",@"n":@"Belarus"},
                 @{@"a":@"BE",@"c":@"32",@"n":@"Belgium"},
                 @{@"a":@"BZ",@"c":@"501",@"n":@"Belize"},
                 @{@"a":@"BJ",@"c":@"229",@"n":@"Benin"},
                 @{@"a":@"BM",@"c":@"1441",@"n":@"Bermuda"},
                 @{@"a":@"BT",@"c":@"975",@"n":@"Bhutan"},
                 @{@"a":@"BO",@"c":@"591",@"n":@"Bolivia",@"r":@"AZ"},
                 @{@"a":@"BA",@"c":@"387",@"n":@"Bosnia and Herzegovina"},
                 @{@"a":@"BW",@"c":@"267",@"n":@"Botswana"},
                 @{@"a":@"BV",@"c":@"00",@"n":@"Bouvet Island"},
                 @{@"a":@"BR",@"c":@"55",@"n":@"Brazil",@"r":@"AZ"},
                 @{@"a":@"VG",@"c":@"1284",@"n":@"British Virgin Islands"},
                 @{@"a":@"IO",@"c":@"246",@"n":@"British Indian Ocean Territory"},
                 @{@"a":@"BN",@"c":@"673",@"n":@"Brunei"},
                 @{@"a":@"BG",@"c":@"359",@"n":@"Bulgaria"},
                 @{@"a":@"BF",@"c":@"226",@"n":@"Burkina-faso"},
                 @{@"a":@"BI",@"c":@"257",@"n":@"Burundi"},
                 @{@"a":@"KH",@"c":@"855",@"n":@"Cambodia"},
                 @{@"a":@"CM",@"c":@"237",@"n":@"Cameroon"},
                 @{@"a":@"CA",@"c":@"1",@"n":@"Canada",@"r":@"AZ"},
                 @{@"a":@"CI",@"c":@"34",@"n":@"Canary Islands",@"r":@"AZ"},
                 @{@"a":@"CV",@"c":@"238",@"n":@"Cape Verde"},
                 @{@"a":@"BQ",@"c":@"599",@"n":@"Caribbean Netherlands"},
                 @{@"a":@"KY",@"c":@"1345",@"n":@"Cayman Islands"},
                 @{@"a":@"CF",@"c":@"236",@"n":@"Central African Republic"},
                 @{@"a":@"EA",@"c":@"952",@"n":@"Ceuta and Melilla"},
                 @{@"a":@"TD",@"c":@"235",@"n":@"Chad"},
                 @{@"a":@"CL",@"c":@"56",@"n":@"Chile",@"r":@"AZ"},
                 @{@"a":@"CN",@"c":@"86",@"n":@"China",@"r":@"AY"},
                 @{@"a":@"CX",@"c":@"61",@"n":@"Christmas Island"},
                 @{@"a":@"FR",@"c":@"33",@"n":@"Clipperton Island"},
                 @{@"a":@"CC",@"c":@"61-891",@"n":@"Cocos (Keeling) Island"},
                 @{@"a":@"CO",@"c":@"57",@"n":@"Colombia",@"r":@"AZ"},
                 @{@"a":@"KM",@"c":@"269",@"n":@"Comoros"},
                 @{@"a":@"CG",@"c":@"242",@"n":@"Congo - Brazzaville"},
                 @{@"a":@"CD",@"c":@"243",@"n":@"Congo - Kinshasa"},
                 @{@"a":@"CR",@"c":@"506",@"n":@"Costa Rica"},
                 @{@"a":@"CI",@"c":@"225",@"n":@"Cote d'lvoire"},
                 @{@"a":@"HR",@"c":@"385",@"n":@"Croatia"},
                 @{@"a":@"CU",@"c":@"53",@"n":@"Cuba"},
                 @{@"a":@"CY",@"c":@"357",@"n":@"Cyprus"},
                 @{@"a":@"CW",@"c":@"599-9",@"n":@"Curacao"},
                 @{@"a":@"CZ",@"c":@"420",@"n":@"Czech Republic"},
                 @{@"a":@"DK",@"c":@"45",@"n":@"Denmark"},
                 @{@"a":@"DG",@"c":@"246",@"n":@"Diego Garcia"},
                 @{@"a":@"DJ",@"c":@"253",@"n":@"Djibouti"},
                 @{@"a":@"DM",@"c":@"1-767",@"n":@"Dominica"},
                 @{@"a":@"DO",@"c":@"1809",@"n":@"Dominican Republic"},
                 @{@"a":@"EC",@"c":@"593",@"n":@"Ecuador",@"r":@"AZ"},
                 @{@"a":@"EG",@"c":@"20",@"n":@"Egypt"},
                 @{@"a":@"SV",@"c":@"503",@"n":@"EI Salvador"},
                 @{@"a":@"GQ",@"c":@"240",@"n":@"Equatorial Guinea"},
                 @{@"a":@"ER",@"c":@"291",@"n":@"Eritrea"},
                 @{@"a":@"EE",@"c":@"372",@"n":@"Estonia"},
                 @{@"a":@"ET",@"c":@"251",@"n":@"Ethiopia"},
                 @{@"a":@"FK",@"c":@"500",@"n":@"Falkland Islands"},
                 @{@"a":@"FO",@"c":@"298",@"n":@"Faroe Islands"},
                 @{@"a":@"FJ",@"c":@"679",@"n":@"Fiji"},
                 @{@"a":@"FI",@"c":@"358",@"n":@"Finland"},
                 @{@"a":@"FR",@"c":@"33",@"n":@"France"},
                 @{@"a":@"GF",@"c":@"594",@"n":@"French Guiana"},
                 @{@"a":@"PF",@"c":@"689",@"n":@"French Polynesia"},
                 @{@"a":@"TF",@"c":@"33",@"n":@"French Southern Territories"},
                 @{@"a":@"GA",@"c":@"241",@"n":@"Gabon"},
                 @{@"a":@"GU",@"c":@"1671",@"n":@"Guam"},
                 @{@"a":@"GM",@"c":@"220",@"n":@"Gambia"},
                 @{@"a":@"GE",@"c":@"995",@"n":@"Georgia"},
                 @{@"a":@"DE",@"c":@"49",@"n":@"Germany"},
                 @{@"a":@"GH",@"c":@"233",@"n":@"Ghana"},
                 @{@"a":@"GI",@"c":@"350",@"n":@"Gibraltar"},
                 @{@"a":@"GR",@"c":@"30",@"n":@"Greece"},
                 @{@"a":@"GL",@"c":@"299",@"n":@"Greenland"},
                 @{@"a":@"GD",@"c":@"1809",@"n":@"Grenada"},
                 @{@"a":@"GP",@"c":@"590",@"n":@"Guadeloupe"},
                 @{@"a":@"GT",@"c":@"502",@"n":@"Guatemala",@"r":@"AZ"},
                 @{@"a":@"GG",@"c":@"44-1481",@"n":@"Guernsey"},
                 @{@"a":@"GN",@"c":@"224",@"n":@"Guinea"},
                 @{@"a":@"GW",@"c":@"245",@"n":@"Guinea-Bissau"},
                 @{@"a":@"GY",@"c":@"592",@"n":@"Guyana"},
                 @{@"a":@"HT",@"c":@"509",@"n":@"Haiti"},
                 @{@"a":@"HN",@"c":@"504",@"n":@"Honduras"},
                 @{@"a":@"HM",@"c":@"672",@"n":@"Heard and Mcdonald Islands"},
                 @{@"a":@"HK",@"c":@"852",@"n":@"Hongkong SAR China",@"r":@"AZ"},
                 @{@"a":@"HU",@"c":@"36",@"n":@"Hungary"},
                 @{@"a":@"IS",@"c":@"354",@"n":@"Iceland"},
                 @{@"a":@"IN",@"c":@"91",@"n":@"India"},
                 @{@"a":@"ID",@"c":@"62",@"n":@"Indonesia",@"r":@"AZ"},
                 @{@"a":@"IR",@"c":@"98",@"n":@"Iran"},
                 @{@"a":@"IQ",@"c":@"964",@"n":@"Iraq"},
                 @{@"a":@"IE",@"c":@"353",@"n":@"Ireland"},
                 @{@"a":@"IM",@"c":@"44",@"n":@"Isle of Man"},
                 @{@"a":@"IL",@"c":@"972",@"n":@"Israel"},
                 @{@"a":@"IT",@"c":@"39",@"n":@"Italy",@"r":@"AZ"},
                 @{@"a":@"CI",@"c":@"225",@"n":@"Ivory Coast"},
                 @{@"a":@"JM",@"c":@"1876",@"n":@"Jamaica"},
                 @{@"a":@"JP",@"c":@"81",@"n":@"Japan",@"r":@"AZ"},
                 @{@"a":@"JE",@"c":@"44",@"n":@"Jersey"},
                 @{@"a":@"JO",@"c":@"962",@"n":@"Jordan"},
                 @{@"a":@"KZ",@"c":@"7",@"n":@"Kazakstan"},
                 @{@"a":@"KE",@"c":@"254",@"n":@"Kenya"},
                 @{@"a":@"KI",@"c":@"686",@"n":@"kiribati"},
                 @{@"a":@"XK",@"c":@"383",@"n":@"kosovo"},
                 @{@"a":@"KR",@"c":@"82",@"n":@"Korea",@"r":@"AZ"},
                 @{@"a":@"KW",@"c":@"965",@"n":@"Kuwait"},
                 @{@"a":@"KG",@"c":@"996",@"n":@"Kyrgyzstan"},
                 @{@"a":@"LA",@"c":@"856",@"n":@"Laos"},
                 @{@"a":@"LV",@"c":@"371",@"n":@"Latvia"},
                 @{@"a":@"LB",@"c":@"961",@"n":@"Lebanon"},
                 @{@"a":@"LS",@"c":@"266",@"n":@"Lesotho"},
                 @{@"a":@"LR",@"c":@"231",@"n":@"Liberia"},
                 @{@"a":@"LY",@"c":@"218",@"n":@"Libya"},
                 @{@"a":@"LI",@"c":@"423",@"n":@"Liechtenstein"},
                 @{@"a":@"LT",@"c":@"370",@"n":@"Lithuania"},
                 @{@"a":@"LU",@"c":@"352",@"n":@"Luxembourg"},
                 @{@"a":@"MO",@"c":@"853",@"n":@"Macao SAR China",@"r":@"AZ"},
                 @{@"a":@"MK",@"c":@"389",@"n":@"Macedonia"},
                 @{@"a":@"MG",@"c":@"261",@"n":@"Madagascar"},
                 @{@"a":@"MW",@"c":@"265",@"n":@"Malawi"},
                 @{@"a":@"MY",@"c":@"60",@"n":@"Malaysia",@"r":@"AZ"},
                 @{@"a":@"MV",@"c":@"960",@"n":@"Maldives"},
                 @{@"a":@"ML",@"c":@"223",@"n":@"Mali"},
                 @{@"a":@"MT",@"c":@"356",@"n":@"Malta"},
                 @{@"a":@"MH",@"c":@"692",@"n":@"Marshall Island"},
                 @{@"a":@"MQ",@"c":@"596",@"n":@"Martinique"},
                 @{@"a":@"MR",@"c":@"222",@"n":@"Mauritania"},
                 @{@"a":@"RE",@"c":@"262",@"n":@"Mayotte"},
                 @{@"a":@"MU",@"c":@"230",@"n":@"Mauritius"},
                 @{@"a":@"MX",@"c":@"52",@"n":@"Mexico",@"r":@"AZ"},
                 @{@"a":@"MD",@"c":@"373",@"n":@"Moldova"},
                 @{@"a":@"MC",@"c":@"377",@"n":@"Monaco"},
                 @{@"a":@"MN",@"c":@"976",@"n":@"Mongolia"},
                 @{@"a":@"ME",@"c":@"382",@"n":@"Montenegro"},
                 @{@"a":@"MI",@"c":@"1664",@"n":@"Montserrat"},
                 @{@"a":@"MA",@"c":@"212",@"n":@"Morocco"},
                 @{@"a":@"FM",@"c":@"691",@"n":@"Micronesia"},
                 @{@"a":@"MZ",@"c":@"258",@"n":@"Mozambique"},
                 @{@"a":@"MM",@"c":@"95",@"n":@"Myanmar(Burma)",@"r":@"AZ"},
                 @{@"a":@"NA",@"c":@"264",@"n":@"Namibia"},
                 @{@"a":@"NR",@"c":@"674",@"n":@"Nauru"},
                 @{@"a":@"NP",@"c":@"977",@"n":@"Nepal"},
                 @{@"a":@"NL",@"c":@"31",@"n":@"Netherlands"},
                 @{@"a":@"NZ",@"c":@"64",@"n":@"New Zealand",@"r":@"AZ"},
                 @{@"a":@"NC",@"c":@"687",@"n":@"New Caledonia",@"r":@"AZ"},
                 @{@"a":@"NI",@"c":@"505",@"n":@"Nicaragua",@"r":@"AZ"},
                 @{@"a":@"NE",@"c":@"227",@"n":@"Niger"},
                 @{@"a":@"NU",@"c":@"683",@"n":@"Niue"},
                 @{@"a":@"NG",@"c":@"234",@"n":@"Nigeria"},
                 @{@"a":@"NF",@"c":@"672",@"n":@"Norfolk Island"},
                 @{@"a":@"KP",@"c":@"850",@"n":@"North Korea"},
                 @{@"a":@"MA",@"c":@"1670",@"n":@"Northern Mariana Islands"},
                 @{@"a":@"NO",@"c":@"47",@"n":@"Norway"},
                 @{@"a":@"OM",@"c":@"968",@"n":@"Oman"},
                 @{@"a":@"PK",@"c":@"92",@"n":@"Pakistan"},
                 @{@"a":@"PW",@"c":@"680",@"n":@"Palau"},
                 @{@"a":@"PS",@"c":@"970",@"n":@"Palestinian Territories"},
                 @{@"a":@"PA",@"c":@"507",@"n":@"Panama"},
                 @{@"a":@"PN",@"c":@"675",@"n":@"Papua New Cuinea"},
                 @{@"a":@"PY",@"c":@"595",@"n":@"Paraguay",@"r":@"AZ"},
                 @{@"a":@"PE",@"c":@"51",@"n":@"Peru",@"r":@"AZ"},
                 @{@"a":@"PH",@"c":@"63",@"n":@"Philippines",@"r":@"AZ"},
                 @{@"a":@"PN",@"c":@"64",@"n":@"Pitcairn Islands"},
                 @{@"a":@"PL",@"c":@"48",@"n":@"Poland"},
                 @{@"a":@"PT",@"c":@"351",@"n":@"Portugal"},
                 @{@"a":@"PR",@"c":@"1787",@"n":@"Puerto Rico",@"r":@"AZ"},
                 @{@"a":@"QA",@"c":@"974",@"n":@"Qatar"},
                 @{@"a":@"RE",@"c":@"262",@"n":@"Reunion"},
                 @{@"a":@"RO",@"c":@"40",@"n":@"Romania"},
                 @{@"a":@"RU",@"c":@"7",@"n":@"Russia"},
                 @{@"a":@"RW",@"c":@"250",@"n":@"Rwanda"},
                 @{@"a":@"SM",@"c":@"378",@"n":@"San Marino"},
                 @{@"a":@"ST",@"c":@"239",@"n":@"Sao tome and principe"},
                 @{@"a":@"SA",@"c":@"966",@"n":@"Saudi Arabia"},@{@"a":@"SN",@"c":@"221",@"n":@"Senegal"},
                 @{@"a":@"RS",@"c":@"381",@"n":@"Serbia"},
                 @{@"a":@"SC",@"c":@"248",@"n":@"Seychelles"},
                 @{@"a":@"SL",@"c":@"232",@"n":@"Sierra Leone"},
                 @{@"a":@"SG",@"c":@"65",@"n":@"Singapore"},
                 @{@"a":@"SX",@"c":@"1-721",@"n":@"Sint Maarten"},
                 @{@"a":@"SK",@"c":@"421",@"n":@"Slovakia"},
                 @{@"a":@"SI",@"c":@"386",@"n":@"Slovenia"},
                 @{@"a":@"GS",@"c":@"500",@"n":@"So.Georgia and So.Sandwich Isl."},
                 @{@"a":@"SO",@"c":@"252",@"n":@"Somalia"},
                 @{@"a":@"SB",@"c":@"677",@"n":@"Solomon Islands"},
                 @{@"a":@"ZA",@"c":@"27",@"n":@"South Africa"},
                 @{@"a":@"SS",@"c":@"211",@"n":@"South sudan"},
                 @{@"a":@"ES",@"c":@"34",@"n":@"Spain"},
                 @{@"a":@"LK",@"c":@"94",@"n":@"Sri Lanka"},
                 @{@"a":@"SD",@"c":@"249",@"n":@"Sudan"},
                 @{@"a":@"BL",@"c":@"590",@"n":@"St.Barthelemy"},
                 @{@"a":@"SH",@"c":@"290",@"n":@"St.Helena"},
                 @{@"a":@"KN",@"c":@"1869",@"n":@"St.Kitts and Nevis"},
                 @{@"a":@"LC",@"c":@"1758",@"n":@"St. Lucia"},
                 @{@"a":@"MF",@"c":@"1721",@"n":@"St. Martin"},
                 @{@"a":@"PM",@"c":@"508",@"n":@"St. Pierre and Miquelon"},
                 @{@"a":@"MF",@"c":@"1721",@"n":@"St. Martin"},
                 @{@"a":@"VC",@"c":@"1784",@"n":@"St. Vincent and Grenadines"},
                 @{@"a":@"SR",@"c":@"597",@"n":@"Suriname",@"r":@"AZ"},
                 @{@"a":@"SJ",@"c":@"47",@"n":@"Svalbard and Jan Mayen"},
                 @{@"a":@"SZ",@"c":@"268",@"n":@"Swaziland"},
                 @{@"a":@"SE",@"c":@"46",@"n":@"Sweden"},
                 @{@"a":@"CH",@"c":@"41",@"n":@"Switzerland"},
                 @{@"a":@"SY",@"c":@"963",@"n":@"Syria"},
                 @{@"a":@"TW",@"c":@"886",@"n":@"Taiwan",@"r":@"AZ"},
                 @{@"a":@"TJ",@"c":@"992",@"n":@"Tajikstan"},
                 @{@"a":@"TZ",@"c":@"255",@"n":@"Tanzania"},
                 @{@"a":@"TH",@"c":@"66",@"n":@"Thailand",@"r":@"AZ"},
                 @{@"a":@"TL",@"c":@"670",@"n":@"Timor-Leste"},
                 @{@"a":@"TG",@"c":@"228",@"n":@"Togo"},
                 @{@"a":@"TK",@"c":@"690",@"n":@"Tokelau"},
                 @{@"a":@"TO",@"c":@"676",@"n":@"Tonga"},
                 @{@"a":@"TT",@"c":@"1868",@"n":@"Trinidad and Tobago"},
                 @{@"a":@"TA",@"c":@"290",@"n":@"Tristan da Cunha"},
                 @{@"a":@"TN",@"c":@"216",@"n":@"Tunisia"},
                 @{@"a":@"TR",@"c":@"90",@"n":@"Turkey"},
                 @{@"a":@"TM",@"c":@"993",@"n":@"Turkmenistan"},
                 @{@"a":@"TC",@"c":@"1",@"n":@"Turks and Caicos Islands"},
                 @{@"a":@"TV",@"c":@"688",@"n":@"Tuvalu"},
                 @{@"a":@"UM",@"c":@"246",@"n":@"U.S. Outlying Islands"},
                 @{@"a":@"VI",@"c":@"1340",@"n":@"U.S. Virgin Islands"},
                 @{@"a":@"UG",@"c":@"256",@"n":@"Uganda"},
                 @{@"a":@"UA",@"c":@"380",@"n":@"Ukraine"},
                 @{@"a":@"AE",@"c":@"971",@"n":@"United Arab Emirates"},
                 @{@"a":@"GB",@"c":@"44",@"n":@"United Kingdom"},
                 @{@"a":@"US",@"c":@"1",@"n":@"USA",@"r":@"AZ"},
                 @{@"a":@"UY",@"c":@"598",@"n":@"Uruguay",@"r":@"AZ"},
                 @{@"a":@"UZ",@"c":@"998",@"n":@"Uzbekistan"},
                 @{@"a":@"VU",@"c":@"678",@"n":@"Vanuatu"},
                 @{@"a":@"VA",@"c":@"379",@"n":@"Vatican City"},
                 @{@"a":@"VE",@"c":@"58",@"n":@"Venezuela",@"r":@"AZ"},
                 @{@"a":@"VN",@"c":@"84",@"n":@"Vietnam",@"r":@"AZ"},
                 @{@"a":@"WF",@"c":@"681",@"n":@"Wallis and Futuna"},
                 @{@"a":@"EH",@"c":@"212",@"n":@"Western Sahara"},
                 @{@"a":@"YE",@"c":@"967",@"n":@"Yemen"},
                 @{@"a":@"YU",@"c":@"381",@"n":@"Yugoslavia"},
                 @{@"a":@"ZR",@"c":@"243",@"n":@"Zaire"},
                 @{@"a":@"ZM",@"c":@"260",@"n":@"Zambia"},
                 @{@"a":@"ZW",@"c":@"263",@"n":@"Zimbabwe"}];
    }
    
    
    if (isChinese) {
        return [@"[{\"a\":\"AF\",\"c\":\"93\",\"n\":\"阿富汗\"},{\"a\":\"AL\",\"c\":\"355\",\"n\":\"阿尔巴尼亚\"},{\"a\":\"DZ\",\"c\":\"213\",\"n\":\"阿尔及利亚\"},{\"a\":\"AD\",\"c\":\"376\",\"n\":\"安道尔共和国\"},{\"a\":\"AI\",\"c\":\"1254\",\"n\":\"安圭拉岛\"},{\"a\":\"AW\",\"c\":\"297\",\"n\":\"阿鲁巴\"},{\"a\":\"AO\",\"c\":\"244\",\"n\":\"安哥拉\"},{\"a\":\"AG\",\"c\":\"1268\",\"n\":\"安提瓜和巴布达\"},{\"a\":\"AR\",\"c\":\"54\",\"n\":\"阿根廷\",\"r\":\"AZ\"},{\"a\":\"AM\",\"c\":\"374\",\"n\":\"亚美尼亚\"},{\"a\":\"AU\",\"c\":\"61\",\"n\":\"澳大利亚\",\"r\":\"AZ\"},{\"a\":\"AT\",\"c\":\"43\",\"n\":\"奥地利\"},{\"a\":\"AX\",\"c\":\"358\",\"n\":\"奥兰群岛\"},{\"a\":\"AZ\",\"c\":\"994\",\"n\":\"阿塞拜疆\"},{\"a\":\"AC\",\"c\":\"247\",\"n\":\"阿森松岛\"},{\"a\":\"BS\",\"c\":\"1242\",\"n\":\"巴哈马\"},{\"a\":\"BH\",\"c\":\"973\",\"n\":\"巴林\"},{\"a\":\"BD\",\"c\":\"880\",\"n\":\"孟加拉国\"},{\"a\":\"BB\",\"c\":\"1246\",\"n\":\"巴巴多斯\"},{\"a\":\"BY\",\"c\":\"375\",\"n\":\"白俄罗斯\"},{\"a\":\"BE\",\"c\":\"32\",\"n\":\"比利时\"},{\"a\":\"BZ\",\"c\":\"501\",\"n\":\"伯利兹\"},{\"a\":\"BJ\",\"c\":\"229\",\"n\":\"贝宁\"},{\"a\":\"BM\",\"c\":\"1441\",\"n\":\"百慕大群岛\"},{\"a\":\"BT\",\"c\":\"975\",\"n\":\"不丹\"},{\"a\":\"BT\",\"c\":\"47\",\"n\":\"布韦岛\"},{\"a\":\"BO\",\"c\":\"591\",\"n\":\"玻利维亚\",\"r\":\"AZ\"},{\"a\":\"BA\",\"c\":\"387\",\"n\":\"波斯尼亚和黑塞哥维那\"},{\"a\":\"BW\",\"c\":\"267\",\"n\":\"博茨瓦纳\"},{\"a\":\"BR\",\"c\":\"55\",\"n\":\"巴西\",\"r\":\"AZ\"},{\"a\":\"VG\",\"c\":\"1284\",\"n\":\"英属维京群岛\"},{\"a\":\"IO\",\"c\":\"246\",\"n\":\"英属印度洋领地\"},{\"a\":\"BN\",\"c\":\"673\",\"n\":\"文莱\"},{\"a\":\"BG\",\"c\":\"359\",\"n\":\"保加利亚\"},{\"a\":\"BF\",\"c\":\"226\",\"n\":\"布基纳法索\"},{\"a\":\"BI\",\"c\":\"257\",\"n\":\"布隆迪\"},{\"a\":\"KH\",\"c\":\"855\",\"n\":\"柬埔寨\"},{\"a\":\"CM\",\"c\":\"237\",\"n\":\"喀麦隆\"},{\"a\":\"CA\",\"c\":\"1\",\"n\":\"加拿大\",\"r\":\"AZ\"},{\"a\":\"CV\",\"c\":\"238\",\"n\":\"佛得角\"},{\"a\":\"FK\",\"c\":\"500\",\"n\":\"福克兰群岛\"},{\"a\":\"KY\",\"c\":\"1345\",\"n\":\"开曼群岛\"},{\"a\":\"CF\",\"c\":\"236\",\"n\":\"中非共和国\"},{\"a\":\"TD\",\"c\":\"235\",\"n\":\"乍得\"},{\"a\":\"CL\",\"c\":\"56\",\"n\":\"智利\",\"r\":\"AZ\"},{\"a\":\"CN\",\"c\":\"86\",\"n\":\"中国\",\"r\":\"AY\"},{\"a\":\"CO\",\"c\":\"57\",\"n\":\"哥伦比亚\",\"r\":\"AZ\"},{\"a\":\"KM\",\"c\":\"269\",\"n\":\"科摩罗\"},{\"a\":\"XK\",\"c\":\"383\",\"n\":\"科索沃\"},{\"a\":\"CC\",\"c\":\"61-891\",\"n\":\"科科斯(基林)群岛\"},{\"a\":\"FR\",\"c\":\"33\",\"n\":\"克利珀顿岛\"},{\"a\":\"CG\",\"c\":\"242\",\"n\":\"刚果(布)\"},{\"a\":\"CD\",\"c\":\"243\",\"n\":\"刚果(金)\"},{\"a\":\"CR\",\"c\":\"506\",\"n\":\"哥斯达黎加\"},{\"a\":\"HR\",\"c\":\"385\",\"n\":\"克罗地亚\"},{\"a\":\"CY\",\"c\":\"357\",\"n\":\"塞浦路斯\"},{\"a\":\"CZ\",\"c\":\"420\",\"n\":\"捷克共和国\"},{\"a\":\"DK\",\"c\":\"45\",\"n\":\"丹麦\"},{\"a\":\"CU\",\"c\":\"53\",\"n\":\"古巴\"},{\"a\":\"DJ\",\"c\":\"253\",\"n\":\"吉布提\"},{\"a\":\"DO\",\"c\":\"1809\",\"n\":\"多米尼加共和国\"},{\"a\":\"DM\",\"c\":\"1-767\",\"n\":\"多米尼克\"},{\"a\":\"EC\",\"c\":\"593\",\"n\":\"厄瓜多尔\",\"r\":\"AZ\"},{\"a\":\"EG\",\"c\":\"20\",\"n\":\"埃及\"},{\"a\":\"SV\",\"c\":\"503\",\"n\":\"萨尔瓦多\"},{\"a\":\"GQ\",\"c\":\"240\",\"n\":\"赤道几内亚\"},{\"a\":\"ER\",\"c\":\"291\",\"n\":\"厄立特里亚\"},{\"a\":\"EE\",\"c\":\"372\",\"n\":\"爱沙尼亚\"},{\"a\":\"FO\",\"c\":\"298\",\"n\":\"法罗群岛\"},{\"a\":\"ET\",\"c\":\"251\",\"n\":\"埃塞俄比亚\"},{\"a\":\"FJ\",\"c\":\"679\",\"n\":\"斐济\"},{\"a\":\"CK\",\"c\":\"682\",\"n\":\"库克群岛\"},{\"a\":\"CW\",\"c\":\"599-9\",\"n\":\"库拉索\"},{\"a\":\"FI\",\"c\":\"358\",\"n\":\"芬兰\"},{\"a\":\"FR\",\"c\":\"33\",\"n\":\"法国\"},{\"a\":\"GF\",\"c\":\"594\",\"n\":\"法属圭亚那\"},{\"a\":\"PF\",\"c\":\"689\",\"n\":\"法属玻利尼西亚\"},{\"a\":\"TF\",\"c\":\"33\",\"n\":\"法属南部领地\"},{\"a\":\"GA\",\"c\":\"241\",\"n\":\"加蓬\"},{\"a\":\"GM\",\"c\":\"220\",\"n\":\"冈比亚\"},{\"a\":\"GE\",\"c\":\"995\",\"n\":\"格鲁吉亚\"},{\"a\":\"DE\",\"c\":\"49\",\"n\":\"德国\"},{\"a\":\"GH\",\"c\":\"233\",\"n\":\"加纳\"},{\"a\":\"ES\",\"c\":\"34\",\"n\":\"加纳利群岛\"},{\"a\":\"GI\",\"c\":\"350\",\"n\":\"直布罗陀\"},{\"a\":\"GR\",\"c\":\"30\",\"n\":\"希腊\"},{\"a\":\"GD\",\"c\":\"1809\",\"n\":\"格林纳达\"},{\"a\":\"GU\",\"c\":\"1671\",\"n\":\"关岛\"},{\"a\":\"GL\",\"c\":\"299\",\"n\":\"格陵兰\"},{\"a\":\"GP\",\"c\":\"590\",\"n\":\"瓜德罗普\"},{\"a\":\"GT\",\"c\":\"502\",\"n\":\"危地马拉\",\"r\":\"AZ\"},{\"a\":\"GN\",\"c\":\"224\",\"n\":\"几内亚\"},{\"a\":\"GW\",\"c\":\"245\",\"n\":\"几内亚比绍\"},{\"a\":\"GY\",\"c\":\"592\",\"n\":\"圭亚那\"},{\"a\":\"HT\",\"c\":\"509\",\"n\":\"海地\"},{\"a\":\"HN\",\"c\":\"504\",\"n\":\"洪都拉斯\"},{\"a\":\"HK\",\"c\":\"852\",\"n\":\"中国香港特别行政区\",\"r\":\"AZ\"},{\"a\":\"HU\",\"c\":\"36\",\"n\":\"匈牙利\"},{\"a\":\"EA\",\"c\":\"952\",\"n\":\"休达及梅利利亚\"},{\"a\":\"IS\",\"c\":\"354\",\"n\":\"冰岛\"},{\"a\":\"IN\",\"c\":\"91\",\"n\":\"印度\"},{\"a\":\"ID\",\"c\":\"62\",\"n\":\"印度尼西亚\",\"r\":\"AZ\"},{\"a\":\"IR\",\"c\":\"98\",\"n\":\"伊朗\"},{\"a\":\"IQ\",\"c\":\"964\",\"n\":\"伊拉克\"},{\"a\":\"IE\",\"c\":\"353\",\"n\":\"爱尔兰\"},{\"a\":\"IM\",\"c\":\"44\",\"n\":\"马恩岛\"},{\"a\":\"IL\",\"c\":\"972\",\"n\":\"以色列\"},{\"a\":\"IT\",\"c\":\"39\",\"n\":\"意大利\",\"r\":\"AZ\"},{\"a\":\"CI\",\"c\":\"225\",\"n\":\"科特迪瓦\"},{\"a\":\"JM\",\"c\":\"1876\",\"n\":\"牙买加\"},{\"a\":\"FM\",\"c\":\"691\",\"n\":\"密克罗尼西亚\"},{\"a\":\"JP\",\"c\":\"81\",\"n\":\"日本\",\"r\":\"AZ\"},{\"a\":\"JO\",\"c\":\"962\",\"n\":\"约旦\"},{\"a\":\"KZ\",\"c\":\"327\",\"n\":\"哈萨克斯坦\"},{\"a\":\"KZ\",\"c\":\"7\",\"n\":\"俄罗斯\"},{\"a\":\"KE\",\"c\":\"254\",\"n\":\"肯尼亚\"},{\"a\":\"KR\",\"c\":\"82\",\"n\":\"韩国\",\"r\":\"AZ\"},{\"a\":\"HM\",\"c\":\"672\",\"n\":\"赫德岛和麦克唐纳群岛\"},{\"a\":\"KW\",\"c\":\"965\",\"n\":\"科威特\"},{\"a\":\"KG\",\"c\":\"996\",\"n\":\"吉尔吉斯斯坦\"},{\"a\":\"KI\",\"c\":\"686\",\"n\":\"基里巴斯\"},{\"a\":\"LA\",\"c\":\"856\",\"n\":\"老挝\"},{\"a\":\"LV\",\"c\":\"371\",\"n\":\"拉脱维亚\"},{\"a\":\"LB\",\"c\":\"961\",\"n\":\"黎巴嫩\"},{\"a\":\"LS\",\"c\":\"266\",\"n\":\"莱索托\"},{\"a\":\"LR\",\"c\":\"231\",\"n\":\"利比里亚\"},{\"a\":\"LY\",\"c\":\"218\",\"n\":\"利比亚\"},{\"a\":\"LT\",\"c\":\"370\",\"n\":\"立陶宛\"},{\"a\":\"LI\",\"c\":\"423\",\"n\":\"列支敦士登\"},{\"a\":\"LU\",\"c\":\"352\",\"n\":\"卢森堡\"},{\"a\":\"MO\",\"c\":\"853\",\"n\":\"中国澳门特别行政区\",\"r\":\"AZ\"},{\"a\":\"MK\",\"c\":\"389\",\"n\":\"马其顿\"},{\"a\":\"MG\",\"c\":\"261\",\"n\":\"马达加斯加\"},{\"a\":\"MW\",\"c\":\"265\",\"n\":\"马拉维\"},{\"a\":\"MY\",\"c\":\"60\",\"n\":\"马来西亚\",\"r\":\"AZ\"},{\"a\":\"MV\",\"c\":\"960\",\"n\":\"马尔代夫\"},{\"a\":\"ML\",\"c\":\"223\",\"n\":\"马里\"},{\"a\":\"MT\",\"c\":\"356\",\"n\":\"马耳他\"},{\"a\":\"MH\",\"c\":\"692\",\"n\":\"马绍尔群岛\"},{\"a\":\"MA\",\"c\":\"1670\",\"n\":\"马里亚那群岛\"},{\"a\":\"MQ\",\"c\":\"596\",\"n\":\"马提尼克\"},{\"a\":\"MR\",\"c\":\"222\",\"n\":\"毛利塔尼亚\"},{\"a\":\"MU\",\"c\":\"230\",\"n\":\"毛里求斯\"},{\"a\":\"MX\",\"c\":\"52\",\"n\":\"墨西哥\",\"r\":\"AZ\"},{\"a\":\"MD\",\"c\":\"373\",\"n\":\"摩尔多瓦\"},{\"a\":\"MC\",\"c\":\"377\",\"n\":\"摩纳哥\"},{\"a\":\"MN\",\"c\":\"976\",\"n\":\"蒙古\"},{\"a\":\"MI\",\"c\":\"1664\",\"n\":\"蒙特塞拉特岛\"},{\"a\":\"ME\",\"c\":\"382\",\"n\":\"黑山共和国\"},{\"a\":\"MA\",\"c\":\"212\",\"n\":\"摩洛哥\"},{\"a\":\"MZ\",\"c\":\"258\",\"n\":\"莫桑比克\"},{\"a\":\"MM\",\"c\":\"95\",\"n\":\"缅甸\",\"r\":\"AZ\"},{\"a\":\"NA\",\"c\":\"264\",\"n\":\"纳米比亚\"},{\"a\":\"NP\",\"c\":\"977\",\"n\":\"尼泊尔\"},{\"a\":\"NR\",\"c\":\"674\",\"n\":\"瑙鲁\"},{\"a\":\"NE\",\"c\":\"599\",\"n\":\"荷属安的列斯\"},{\"a\":\"BQ\",\"c\":\"599\",\"n\":\"荷属加勒比区\"},{\"a\":\"SX\",\"c\":\"1-721\",\"n\":\"荷属加圣马丁\"},{\"a\":\"NL\",\"c\":\"31\",\"n\":\"荷兰\"},{\"a\":\"NZ\",\"c\":\"64\",\"n\":\"新西兰\",\"r\":\"AZ\"},{\"a\":\"NI\",\"c\":\"505\",\"n\":\"尼加拉瓜\",\"r\":\"AZ\"},{\"a\":\"NE\",\"c\":\"227\",\"n\":\"尼日尔\"},{\"a\":\"NU\",\"c\":\"683\",\"n\":\"纽埃\"},{\"a\":\"NG\",\"c\":\"234\",\"n\":\"尼日利亚\"},{\"a\":\"KP\",\"c\":\"850\",\"n\":\"朝鲜\"},{\"a\":\"NO\",\"c\":\"47\",\"n\":\"挪威\"},{\"a\":\"OM\",\"c\":\"968\",\"n\":\"阿曼\"},{\"a\":\"PK\",\"c\":\"92\",\"n\":\"巴基斯坦\"},{\"a\":\"PA\",\"c\":\"507\",\"n\":\"巴拿马\"},{\"a\":\"PG\",\"c\":\"675\",\"n\":\"巴布亚新几内亚\"},{\"a\":\"PS\",\"c\":\"970\",\"n\":\"巴勒斯坦领土\"},{\"a\":\"PY\",\"c\":\"595\",\"n\":\"巴拉圭\",\"r\":\"AZ\"},{\"a\":\"PE\",\"c\":\"51\",\"n\":\"秘鲁\",\"r\":\"AZ\"},{\"a\":\"PH\",\"c\":\"63\",\"n\":\"菲律宾\",\"r\":\"AZ\"},{\"a\":\"PL\",\"c\":\"48\",\"n\":\"波兰\"},{\"a\":\"PT\",\"c\":\"351\",\"n\":\"葡萄牙\"},{\"a\":\"PR\",\"c\":\"1787\",\"n\":\"波多黎各\",\"r\":\"AZ\"},{\"a\":\"QA\",\"c\":\"974\",\"n\":\"卡塔尔\"},{\"a\":\"RE\",\"c\":\"262\",\"n\":\"马约特\"},{\"a\":\"RE\",\"c\":\"262\",\"n\":\"留尼旺\"},{\"a\":\"RO\",\"c\":\"40\",\"n\":\"罗马尼亚\"},{\"a\":\"RU\",\"c\":\"7\",\"n\":\"俄罗斯\"},{\"a\":\"LC\",\"c\":\"1758\",\"n\":\"圣卢西亚\"},{\"a\":\"SV\",\"c\":\"1784\",\"n\":\"圣文森特岛\"},{\"a\":\"SE\",\"c\":\"684\",\"n\":\"东萨摩亚\"},{\"a\":\"TL\",\"c\":\"670\",\"n\":\"东帝汶\"},{\"a\":\"SW\",\"c\":\"685\",\"n\":\"西萨摩亚\"},{\"a\":\"RW\",\"c\":\"250\",\"n\":\"卢旺达\"},{\"a\":\"SM\",\"c\":\"378\",\"n\":\"圣马力诺\"},{\"a\":\"PM\",\"c\":\"508\",\"n\":\"圣皮埃尔和密克隆群岛\"},{\"a\":\"MF\",\"c\":\"1721\",\"n\":\"圣马丁岛\"},{\"a\":\"PW\",\"c\":\"680\",\"n\":\"帕劳\"},{\"a\":\"PN\",\"c\":\"64\",\"n\":\"皮特凯恩群岛\"},{\"a\":\"NF\",\"c\":\"672\",\"n\":\"诺福克岛\"},{\"a\":\"SA\",\"c\":\"966\",\"n\":\"沙特阿拉伯\"},{\"a\":\"GG\",\"c\":\"44-1481\",\"n\":\"格恩西岛\"},{\"a\":\"ST\",\"c\":\"239\",\"n\":\"圣多美和普林西比\"},{\"a\":\"BL\",\"c\":\"590\",\"n\":\"圣巴泰勒米\"},{\"a\":\"SH\",\"c\":\"290\",\"n\":\"圣赫勒拿\"},{\"a\":\"VC\",\"c\":\"1784\",\"n\":\"圣文森特和格林纳丁斯\"},{\"a\":\"KN\",\"c\":\"1869\",\"n\":\"圣基茨和尼维斯\"},{\"a\":\"CX\",\"c\":\"61\",\"n\":\"圣诞岛\"},{\"a\":\"SN\",\"c\":\"221\",\"n\":\"塞内加尔\"},{\"a\":\"SC\",\"c\":\"248\",\"n\":\"塞舌尔\"},{\"a\":\"RS\",\"c\":\"381\",\"n\":\"塞尔维亚\"},{\"a\":\"SL\",\"c\":\"232\",\"n\":\"塞拉利昂\"},{\"a\":\"SG\",\"c\":\"65\",\"n\":\"新加坡\"},{\"a\":\"NC\",\"c\":\"687\",\"n\":\"新喀里多尼亚\"},{\"a\":\"SK\",\"c\":\"421\",\"n\":\"斯洛伐克\"},{\"a\":\"SJ\",\"c\":\"47\",\"n\":\"斯瓦尔巴和扬马延\"},{\"a\":\"SI\",\"c\":\"386\",\"n\":\"斯洛文尼亚\"},{\"a\":\"SB\",\"c\":\"677\",\"n\":\"所罗门群岛\"},{\"a\":\"SO\",\"c\":\"252\",\"n\":\"索马里\"},{\"a\":\"ZA\",\"c\":\"27\",\"n\":\"南非\"},{\"a\":\"AQ\",\"c\":\"672\",\"n\":\"南极洲\"},{\"a\":\"SS\",\"c\":\"211\",\"n\":\"南苏丹\"},{\"a\":\"GS\",\"c\":\"500\",\"n\":\"南乔治亚和南桑威奇群岛\"},{\"a\":\"ES\",\"c\":\"34\",\"n\":\"西班牙\"},{\"a\":\"LK\",\"c\":\"94\",\"n\":\"斯里兰卡\"},{\"a\":\"SD\",\"c\":\"249\",\"n\":\"苏丹\"},{\"a\":\"SR\",\"c\":\"597\",\"n\":\"苏里南\",\"r\":\"AZ\"},{\"a\":\"SZ\",\"c\":\"268\",\"n\":\"斯威士兰\"},{\"a\":\"SE\",\"c\":\"46\",\"n\":\"瑞典\"},{\"a\":\"CH\",\"c\":\"41\",\"n\":\"瑞士\"},{\"a\":\"SY\",\"c\":\"963\",\"n\":\"叙利亚\"},{\"a\":\"TW\",\"c\":\"886\",\"n\":\"中国台湾\",\"r\":\"AZ\"},{\"a\":\"TJ\",\"c\":\"992\",\"n\":\"塔吉克斯坦\"},{\"a\":\"TZ\",\"c\":\"255\",\"n\":\"坦桑尼亚\"},{\"a\":\"TH\",\"c\":\"66\",\"n\":\"泰国\",\"r\":\"AZ\"},{\"a\":\"TG\",\"c\":\"228\",\"n\":\"多哥\"},{\"a\":\"TO\",\"c\":\"676\",\"n\":\"汤加\"},{\"a\":\"TT\",\"c\":\"1868\",\"n\":\"特立尼达和多巴哥\"},{\"a\":\"TA\",\"c\":\"290\",\"n\":\"特里斯坦-达库尼亚群岛\"},{\"a\":\"TC\",\"c\":\"1\",\"n\":\"特克斯和凯科斯群岛\"},{\"a\":\"TN\",\"c\":\"216\",\"n\":\"突尼斯\"},{\"a\":\"TV\",\"c\":\"688\",\"n\":\"图瓦卢\"},{\"a\":\"TR\",\"c\":\"90\",\"n\":\"土耳其\"},{\"a\":\"TK\",\"c\":\"690\",\"n\":\"托克劳\"},{\"a\":\"TM\",\"c\":\"993\",\"n\":\"土库曼斯坦\"},{\"a\":\"WF\",\"c\":\"681\",\"n\":\"瓦利斯和富图纳\"},{\"a\":\"VU\",\"c\":\"678\",\"n\":\"瓦努阿图\"},{\"a\":\"VI\",\"c\":\"1340\",\"n\":\"美属维尔京群岛\"},{\"a\":\"AS\",\"c\":\"1684\",\"n\":\"美属萨摩亚\"},{\"a\":\"UG\",\"c\":\"256\",\"n\":\"乌干达\"},{\"a\":\"UA\",\"c\":\"380\",\"n\":\"乌克兰\"},{\"a\":\"AE\",\"c\":\"971\",\"n\":\"阿拉伯联合酋长国\"},{\"a\":\"GB\",\"c\":\"44\",\"n\":\"英国\"},{\"a\":\"UM\",\"c\":\"246\",\"n\":\"美国本土外小岛屿\"},{\"a\":\"US\",\"c\":\"1\",\"n\":\"美国\",\"r\":\"AZ\"},{\"a\":\"UY\",\"c\":\"598\",\"n\":\"乌拉圭\",\"r\":\"AZ\"},{\"a\":\"UZ\",\"c\":\"998\",\"n\":\"乌兹别克斯坦\"},{\"a\":\"EH\",\"c\":\"212\",\"n\":\"西撒哈拉\"},{\"a\":\"VA\",\"c\":\"379\",\"n\":\"梵蒂冈城\"},{\"a\":\"VE\",\"c\":\"58\",\"n\":\"委内瑞拉\",\"r\":\"AZ\"},{\"a\":\"DG\",\"c\":\"246\",\"n\":\"迪戈加西亚岛\"},{\"a\":\"VN\",\"c\":\"84\",\"n\":\"越南\",\"r\":\"AZ\"},{\"a\":\"YE\",\"c\":\"967\",\"n\":\"也门\"},{\"a\":\"YU\",\"c\":\"381\",\"n\":\"南斯拉夫\"},{\"a\":\"ZM\",\"c\":\"260\",\"n\":\"赞比亚\"},{\"a\":\"JE\",\"c\":\"44\",\"n\":\"泽西岛\"},{\"a\":\"ZA\",\"c\":\"243\",\"n\":\"扎伊尔\"},{\"a\":\"ZW\",\"c\":\"263\",\"n\":\"津巴布韦\"}]" tp_objectFromJSONString];
    } else {
        return [@"[{\"a\":\"CK\",\"c\":\"682\",\"n\":\"Cook Islands\"},{\"a\":\"AF\",\"c\":\"93\",\"n\":\"Afghanistan\"},{\"a\":\"AL\",\"c\":\"355\",\"n\":\"Albania\"},{\"a\":\"AZ\",\"c\":\"358\",\"n\":\"Aland Islands\"},{\"a\":\"DZ\",\"c\":\"213\",\"n\":\"Algeria\"},{\"a\":\"AO\",\"c\":\"244\",\"n\":\"Angola\"},{\"a\":\"AS\",\"c\":\"1684\",\"n\":\"American Samoa\"},{\"a\":\"AN\",\"c\":\"376\",\"n\":\"Andorra\"},{\"a\":\"AW\",\"c\":\"297\",\"n\":\"Aruba\"},{\"a\":\"AR\",\"c\":\"54\",\"n\":\"Argentina\",\"r\":\"AZ\"},{\"a\":\"AM\",\"c\":\"374\",\"n\":\"Armenia\"},{\"a\":\"AM\",\"c\":\"1254\",\"n\":\"Anguilla\"},{\"a\":\"AU\",\"c\":\"61\",\"n\":\"Australia\",\"r\":\"AZ\"},{\"a\":\"AQ\",\"c\":\"672\",\"n\":\"Antarctica\"},{\"a\":\"AC\",\"c\":\"247\",\"n\":\"Ascension Island\"},{\"a\":\"AT\",\"c\":\"43\",\"n\":\"Austria\"},{\"a\":\"AG\",\"c\":\"1268\",\"n\":\"Antigua & Barbuda\"},{\"a\":\"AZ\",\"c\":\"994\",\"n\":\"Azerbaijan\"},{\"a\":\"BH\",\"c\":\"973\",\"n\":\"Bahrain\"},{\"a\":\"BB\",\"c\":\"1246\",\"n\":\"Barbados\"},{\"a\":\"BS\",\"c\":\"1242\",\"n\":\"Bahamas\"},{\"a\":\"BD\",\"c\":\"880\",\"n\":\"Bangladesh\"},{\"a\":\"BY\",\"c\":\"375\",\"n\":\"Belarus\"},{\"a\":\"BE\",\"c\":\"32\",\"n\":\"Belgium\"},{\"a\":\"BZ\",\"c\":\"501\",\"n\":\"Belize\"},{\"a\":\"BJ\",\"c\":\"229\",\"n\":\"Benin\"},{\"a\":\"BM\",\"c\":\"1441\",\"n\":\"Bermuda\"},{\"a\":\"BT\",\"c\":\"975\",\"n\":\"Bhutan\"},{\"a\":\"BO\",\"c\":\"591\",\"n\":\"Bolivia\",\"r\":\"AZ\"},{\"a\":\"BA\",\"c\":\"387\",\"n\":\"Bosnia and Herzegovina\"},{\"a\":\"BW\",\"c\":\"267\",\"n\":\"Botswana\"},{\"a\":\"BV\",\"c\":\"00\",\"n\":\"Bouvet Island\"},{\"a\":\"BR\",\"c\":\"55\",\"n\":\"Brazil\",\"r\":\"AZ\"},{\"a\":\"VG\",\"c\":\"1284\",\"n\":\"British Virgin Islands\"},{\"a\":\"IO\",\"c\":\"246\",\"n\":\"British Indian Ocean Territory\"},{\"a\":\"BN\",\"c\":\"673\",\"n\":\"Brunei\"},{\"a\":\"BG\",\"c\":\"359\",\"n\":\"Bulgaria\"},{\"a\":\"BF\",\"c\":\"226\",\"n\":\"Burkina-faso\"},{\"a\":\"BI\",\"c\":\"257\",\"n\":\"Burundi\"},{\"a\":\"KH\",\"c\":\"855\",\"n\":\"Cambodia\"},{\"a\":\"CM\",\"c\":\"237\",\"n\":\"Cameroon\"},{\"a\":\"CA\",\"c\":\"1\",\"n\":\"Canada\",\"r\":\"AZ\"},{\"a\":\"CI\",\"c\":\"34\",\"n\":\"Canary Islands\",\"r\":\"AZ\"},{\"a\":\"CV\",\"c\":\"238\",\"n\":\"Cape Verde\"},{\"a\":\"BQ\",\"c\":\"599\",\"n\":\"Caribbean Netherlands\"},{\"a\":\"KY\",\"c\":\"1345\",\"n\":\"Cayman Islands\"},{\"a\":\"CF\",\"c\":\"236\",\"n\":\"Central African Republic\"},{\"a\":\"EA\",\"c\":\"952\",\"n\":\"Ceuta and Melilla\"},{\"a\":\"TD\",\"c\":\"235\",\"n\":\"Chad\"},{\"a\":\"CL\",\"c\":\"56\",\"n\":\"Chile\",\"r\":\"AZ\"},{\"a\":\"CN\",\"c\":\"86\",\"n\":\"China\",\"r\":\"AY\"},{\"a\":\"CX\",\"c\":\"61\",\"n\":\"Christmas Island\"},{\"a\":\"FR\",\"c\":\"33\",\"n\":\"Clipperton Island\"},{\"a\":\"CC\",\"c\":\"61-891\",\"n\":\"Cocos (Keeling) Island\"},{\"a\":\"CO\",\"c\":\"57\",\"n\":\"Colombia\",\"r\":\"AZ\"},{\"a\":\"KM\",\"c\":\"269\",\"n\":\"Comoros\"},{\"a\":\"CG\",\"c\":\"242\",\"n\":\"Congo - Brazzaville\"},{\"a\":\"CD\",\"c\":\"243\",\"n\":\"Congo - Kinshasa\"},{\"a\":\"CR\",\"c\":\"506\",\"n\":\"Costa Rica\"},{\"a\":\"CI\",\"c\":\"225\",\"n\":\"Cote d'lvoire\"},{\"a\":\"HR\",\"c\":\"385\",\"n\":\"Croatia\"},{\"a\":\"CU\",\"c\":\"53\",\"n\":\"Cuba\"},{\"a\":\"CY\",\"c\":\"357\",\"n\":\"Cyprus\"},{\"a\":\"CW\",\"c\":\"599-9\",\"n\":\"Curacao\"},{\"a\":\"CZ\",\"c\":\"420\",\"n\":\"Czech Republic\"},{\"a\":\"DK\",\"c\":\"45\",\"n\":\"Denmark\"},{\"a\":\"DG\",\"c\":\"246\",\"n\":\"Diego Garcia\"},{\"a\":\"DJ\",\"c\":\"253\",\"n\":\"Djibouti\"},{\"a\":\"DM\",\"c\":\"1-767\",\"n\":\"Dominica\"},{\"a\":\"DO\",\"c\":\"1809\",\"n\":\"Dominican Republic\"},{\"a\":\"EC\",\"c\":\"593\",\"n\":\"Ecuador\",\"r\":\"AZ\"},{\"a\":\"EG\",\"c\":\"20\",\"n\":\"Egypt\"},{\"a\":\"SV\",\"c\":\"503\",\"n\":\"EI Salvador\"},{\"a\":\"GQ\",\"c\":\"240\",\"n\":\"Equatorial Guinea\"},{\"a\":\"ER\",\"c\":\"291\",\"n\":\"Eritrea\"},{\"a\":\"EE\",\"c\":\"372\",\"n\":\"Estonia\"},{\"a\":\"ET\",\"c\":\"251\",\"n\":\"Ethiopia\"},{\"a\":\"FK\",\"c\":\"500\",\"n\":\"Falkland Islands\"},{\"a\":\"FO\",\"c\":\"298\",\"n\":\"Faroe Islands\"},{\"a\":\"FJ\",\"c\":\"679\",\"n\":\"Fiji\"},{\"a\":\"FI\",\"c\":\"358\",\"n\":\"Finland\"},{\"a\":\"FR\",\"c\":\"33\",\"n\":\"France\"},{\"a\":\"GF\",\"c\":\"594\",\"n\":\"French Guiana\"},{\"a\":\"PF\",\"c\":\"689\",\"n\":\"French Polynesia\"},{\"a\":\"TF\",\"c\":\"33\",\"n\":\"French Southern Territories\"},{\"a\":\"GA\",\"c\":\"241\",\"n\":\"Gabon\"},{\"a\":\"GU\",\"c\":\"1671\",\"n\":\"Guam\"},{\"a\":\"GM\",\"c\":\"220\",\"n\":\"Gambia\"},{\"a\":\"GE\",\"c\":\"995\",\"n\":\"Georgia\"},{\"a\":\"DE\",\"c\":\"49\",\"n\":\"Germany\"},{\"a\":\"GH\",\"c\":\"233\",\"n\":\"Ghana\"},{\"a\":\"GI\",\"c\":\"350\",\"n\":\"Gibraltar\"},{\"a\":\"GR\",\"c\":\"30\",\"n\":\"Greece\"},{\"a\":\"GL\",\"c\":\"299\",\"n\":\"Greenland\"},{\"a\":\"GD\",\"c\":\"1809\",\"n\":\"Grenada\"},{\"a\":\"GP\",\"c\":\"590\",\"n\":\"Guadeloupe\"},{\"a\":\"GT\",\"c\":\"502\",\"n\":\"Guatemala\",\"r\":\"AZ\"},{\"a\":\"GG\",\"c\":\"44-1481\",\"n\":\"Guernsey\"},{\"a\":\"GN\",\"c\":\"224\",\"n\":\"Guinea\"},{\"a\":\"GW\",\"c\":\"245\",\"n\":\"Guinea-Bissau\"},{\"a\":\"GY\",\"c\":\"592\",\"n\":\"Guyana\"},{\"a\":\"HT\",\"c\":\"509\",\"n\":\"Haiti\"},{\"a\":\"HN\",\"c\":\"504\",\"n\":\"Honduras\"},{\"a\":\"HM\",\"c\":\"672\",\"n\":\"Heard and Mcdonald Islands\"},{\"a\":\"HK\",\"c\":\"852\",\"n\":\"Hongkong SAR China\",\"r\":\"AZ\"},{\"a\":\"HU\",\"c\":\"36\",\"n\":\"Hungary\"},{\"a\":\"IS\",\"c\":\"354\",\"n\":\"Iceland\"},{\"a\":\"IN\",\"c\":\"91\",\"n\":\"India\"},{\"a\":\"ID\",\"c\":\"62\",\"n\":\"Indonesia\",\"r\":\"AZ\"},{\"a\":\"IR\",\"c\":\"98\",\"n\":\"Iran\"},{\"a\":\"IQ\",\"c\":\"964\",\"n\":\"Iraq\"},{\"a\":\"IE\",\"c\":\"353\",\"n\":\"Ireland\"},{\"a\":\"IM\",\"c\":\"44\",\"n\":\"Isle of Man\"},{\"a\":\"IL\",\"c\":\"972\",\"n\":\"Israel\"},{\"a\":\"IT\",\"c\":\"39\",\"n\":\"Italy\",\"r\":\"AZ\"},{\"a\":\"CI\",\"c\":\"225\",\"n\":\"Ivory Coast\"},{\"a\":\"JM\",\"c\":\"1876\",\"n\":\"Jamaica\"},{\"a\":\"JP\",\"c\":\"81\",\"n\":\"Japan\",\"r\":\"AZ\"},{\"a\":\"JE\",\"c\":\"44\",\"n\":\"Jersey\"},{\"a\":\"JO\",\"c\":\"962\",\"n\":\"Jordan\"},{\"a\":\"KZ\",\"c\":\"7\",\"n\":\"Kazakstan\"},{\"a\":\"KE\",\"c\":\"254\",\"n\":\"Kenya\"},{\"a\":\"KI\",\"c\":\"686\",\"n\":\"kiribati\"},{\"a\":\"XK\",\"c\":\"383\",\"n\":\"kosovo\"},{\"a\":\"KR\",\"c\":\"82\",\"n\":\"Korea\",\"r\":\"AZ\"},{\"a\":\"KW\",\"c\":\"965\",\"n\":\"Kuwait\"},{\"a\":\"KG\",\"c\":\"996\",\"n\":\"Kyrgyzstan\"},{\"a\":\"LA\",\"c\":\"856\",\"n\":\"Laos\"},{\"a\":\"LV\",\"c\":\"371\",\"n\":\"Latvia\"},{\"a\":\"LB\",\"c\":\"961\",\"n\":\"Lebanon\"},{\"a\":\"LS\",\"c\":\"266\",\"n\":\"Lesotho\"},{\"a\":\"LR\",\"c\":\"231\",\"n\":\"Liberia\"},{\"a\":\"LY\",\"c\":\"218\",\"n\":\"Libya\"},{\"a\":\"LI\",\"c\":\"423\",\"n\":\"Liechtenstein\"},{\"a\":\"LT\",\"c\":\"370\",\"n\":\"Lithuania\"},{\"a\":\"LU\",\"c\":\"352\",\"n\":\"Luxembourg\"},{\"a\":\"MO\",\"c\":\"853\",\"n\":\"Macao SAR China\",\"r\":\"AZ\"},{\"a\":\"MK\",\"c\":\"389\",\"n\":\"Macedonia\"},{\"a\":\"MG\",\"c\":\"261\",\"n\":\"Madagascar\"},{\"a\":\"MW\",\"c\":\"265\",\"n\":\"Malawi\"},{\"a\":\"MY\",\"c\":\"60\",\"n\":\"Malaysia\",\"r\":\"AZ\"},{\"a\":\"MV\",\"c\":\"960\",\"n\":\"Maldives\"},{\"a\":\"ML\",\"c\":\"223\",\"n\":\"Mali\"},{\"a\":\"MT\",\"c\":\"356\",\"n\":\"Malta\"},{\"a\":\"MH\",\"c\":\"692\",\"n\":\"Marshall Island\"},{\"a\":\"MQ\",\"c\":\"596\",\"n\":\"Martinique\"},{\"a\":\"MR\",\"c\":\"222\",\"n\":\"Mauritania\"},{\"a\":\"RE\",\"c\":\"262\",\"n\":\"Mayotte\"},{\"a\":\"MU\",\"c\":\"230\",\"n\":\"Mauritius\"},{\"a\":\"MX\",\"c\":\"52\",\"n\":\"Mexico\",\"r\":\"AZ\"},{\"a\":\"MD\",\"c\":\"373\",\"n\":\"Moldova\"},{\"a\":\"MC\",\"c\":\"377\",\"n\":\"Monaco\"},{\"a\":\"MN\",\"c\":\"976\",\"n\":\"Mongolia\"},{\"a\":\"ME\",\"c\":\"382\",\"n\":\"Montenegro\"},{\"a\":\"MI\",\"c\":\"1664\",\"n\":\"Montserrat\"},{\"a\":\"MA\",\"c\":\"212\",\"n\":\"Morocco\"},{\"a\":\"FM\",\"c\":\"691\",\"n\":\"Micronesia\"},{\"a\":\"MZ\",\"c\":\"258\",\"n\":\"Mozambique\"},{\"a\":\"MM\",\"c\":\"95\",\"n\":\"Myanmar(Burma)\",\"r\":\"AZ\"},{\"a\":\"NA\",\"c\":\"264\",\"n\":\"Namibia\"},{\"a\":\"NR\",\"c\":\"674\",\"n\":\"Nauru\"},{\"a\":\"NP\",\"c\":\"977\",\"n\":\"Nepal\"},{\"a\":\"NL\",\"c\":\"31\",\"n\":\"Netherlands\"},{\"a\":\"NZ\",\"c\":\"64\",\"n\":\"New Zealand\",\"r\":\"AZ\"},{\"a\":\"NC\",\"c\":\"687\",\"n\":\"New Caledonia\",\"r\":\"AZ\"},{\"a\":\"NI\",\"c\":\"505\",\"n\":\"Nicaragua\",\"r\":\"AZ\"},{\"a\":\"NE\",\"c\":\"227\",\"n\":\"Niger\"},{\"a\":\"NU\",\"c\":\"683\",\"n\":\"Niue\"},{\"a\":\"NG\",\"c\":\"234\",\"n\":\"Nigeria\"},{\"a\":\"NF\",\"c\":\"672\",\"n\":\"Norfolk Island\"},{\"a\":\"KP\",\"c\":\"850\",\"n\":\"North Korea\"},{\"a\":\"MA\",\"c\":\"1670\",\"n\":\"Northern Mariana Islands\"},{\"a\":\"NO\",\"c\":\"47\",\"n\":\"Norway\"},{\"a\":\"OM\",\"c\":\"968\",\"n\":\"Oman\"},{\"a\":\"PK\",\"c\":\"92\",\"n\":\"Pakistan\"},{\"a\":\"PW\",\"c\":\"680\",\"n\":\"Palau\"},{\"a\":\"PS\",\"c\":\"970\",\"n\":\"Palestinian Territories\"},{\"a\":\"PA\",\"c\":\"507\",\"n\":\"Panama\"},{\"a\":\"PN\",\"c\":\"675\",\"n\":\"Papua New Cuinea\"},{\"a\":\"PY\",\"c\":\"595\",\"n\":\"Paraguay\",\"r\":\"AZ\"},{\"a\":\"PE\",\"c\":\"51\",\"n\":\"Peru\",\"r\":\"AZ\"},{\"a\":\"PH\",\"c\":\"63\",\"n\":\"Philippines\",\"r\":\"AZ\"},{\"a\":\"PN\",\"c\":\"64\",\"n\":\"Pitcairn Islands\"},{\"a\":\"PL\",\"c\":\"48\",\"n\":\"Poland\"},{\"a\":\"PT\",\"c\":\"351\",\"n\":\"Portugal\"},{\"a\":\"PR\",\"c\":\"1787\",\"n\":\"Puerto Rico\",\"r\":\"AZ\"},{\"a\":\"QA\",\"c\":\"974\",\"n\":\"Qatar\"},{\"a\":\"RE\",\"c\":\"262\",\"n\":\"Reunion\"},{\"a\":\"RO\",\"c\":\"40\",\"n\":\"Romania\"},{\"a\":\"RU\",\"c\":\"7\",\"n\":\"Russia\"},{\"a\":\"RW\",\"c\":\"250\",\"n\":\"Rwanda\"},{\"a\":\"SM\",\"c\":\"378\",\"n\":\"San Marino\"},{\"a\":\"ST\",\"c\":\"239\",\"n\":\"Sao tome and principe\"},{\"a\":\"SA\",\"c\":\"966\",\"n\":\"Saudi Arabia\"},{\"a\":\"SN\",\"c\":\"221\",\"n\":\"Senegal\"},{\"a\":\"RS\",\"c\":\"381\",\"n\":\"Serbia\"},{\"a\":\"SC\",\"c\":\"248\",\"n\":\"Seychelles\"},{\"a\":\"SL\",\"c\":\"232\",\"n\":\"Sierra Leone\"},{\"a\":\"SG\",\"c\":\"65\",\"n\":\"Singapore\"},{\"a\":\"SX\",\"c\":\"1-721\",\"n\":\"Sint Maarten\"},{\"a\":\"SK\",\"c\":\"421\",\"n\":\"Slovakia\"},{\"a\":\"SI\",\"c\":\"386\",\"n\":\"Slovenia\"},{\"a\":\"GS\",\"c\":\"500\",\"n\":\"So.Georgia and So.Sandwich Isl.\"},{\"a\":\"SO\",\"c\":\"252\",\"n\":\"Somalia\"},{\"a\":\"SB\",\"c\":\"677\",\"n\":\"Solomon Islands\"},{\"a\":\"ZA\",\"c\":\"27\",\"n\":\"South Africa\"},{\"a\":\"SS\",\"c\":\"211\",\"n\":\"South sudan\"},{\"a\":\"ES\",\"c\":\"34\",\"n\":\"Spain\"},{\"a\":\"LK\",\"c\":\"94\",\"n\":\"Sri Lanka\"},{\"a\":\"SD\",\"c\":\"249\",\"n\":\"Sudan\"},{\"a\":\"BL\",\"c\":\"590\",\"n\":\"St.Barthelemy\"},{\"a\":\"SH\",\"c\":\"290\",\"n\":\"St.Helena\"},{\"a\":\"KN\",\"c\":\"1869\",\"n\":\"St.Kitts and Nevis\"},{\"a\":\"LC\",\"c\":\"1758\",\"n\":\"St. Lucia\"},{\"a\":\"MF\",\"c\":\"1721\",\"n\":\"St. Martin\"},{\"a\":\"PM\",\"c\":\"508\",\"n\":\"St. Pierre and Miquelon\"},{\"a\":\"MF\",\"c\":\"1721\",\"n\":\"St. Martin\"},{\"a\":\"VC\",\"c\":\"1784\",\"n\":\"St. Vincent and Grenadines\"},{\"a\":\"SR\",\"c\":\"597\",\"n\":\"Suriname\",\"r\":\"AZ\"},{\"a\":\"SJ\",\"c\":\"47\",\"n\":\"Svalbard and Jan Mayen\"},{\"a\":\"SZ\",\"c\":\"268\",\"n\":\"Swaziland\"},{\"a\":\"SE\",\"c\":\"46\",\"n\":\"Sweden\"},{\"a\":\"CH\",\"c\":\"41\",\"n\":\"Switzerland\"},{\"a\":\"SY\",\"c\":\"963\",\"n\":\"Syria\"},{\"a\":\"TW\",\"c\":\"886\",\"n\":\"Taiwan\",\"r\":\"AZ\"},{\"a\":\"TJ\",\"c\":\"992\",\"n\":\"Tajikstan\"},{\"a\":\"TZ\",\"c\":\"255\",\"n\":\"Tanzania\"},{\"a\":\"TH\",\"c\":\"66\",\"n\":\"Thailand\",\"r\":\"AZ\"},{\"a\":\"TL\",\"c\":\"670\",\"n\":\"Timor-Leste\"},{\"a\":\"TG\",\"c\":\"228\",\"n\":\"Togo\"},{\"a\":\"TK\",\"c\":\"690\",\"n\":\"Tokelau\"},{\"a\":\"TO\",\"c\":\"676\",\"n\":\"Tonga\"},{\"a\":\"TT\",\"c\":\"1868\",\"n\":\"Trinidad and Tobago\"},{\"a\":\"TA\",\"c\":\"290\",\"n\":\"Tristan da Cunha\"},{\"a\":\"TN\",\"c\":\"216\",\"n\":\"Tunisia\"},{\"a\":\"TR\",\"c\":\"90\",\"n\":\"Turkey\"},{\"a\":\"TM\",\"c\":\"993\",\"n\":\"Turkmenistan\"},{\"a\":\"TC\",\"c\":\"1\",\"n\":\"Turks and Caicos Islands\"},{\"a\":\"TV\",\"c\":\"688\",\"n\":\"Tuvalu\"},{\"a\":\"UM\",\"c\":\"246\",\"n\":\"U.S. Outlying Islands\"},{\"a\":\"VI\",\"c\":\"1340\",\"n\":\"U.S. Virgin Islands\"},{\"a\":\"UG\",\"c\":\"256\",\"n\":\"Uganda\"},{\"a\":\"UA\",\"c\":\"380\",\"n\":\"Ukraine\"},{\"a\":\"AE\",\"c\":\"971\",\"n\":\"United Arab Emirates\"},{\"a\":\"GB\",\"c\":\"44\",\"n\":\"United Kingdom\"},{\"a\":\"US\",\"c\":\"1\",\"n\":\"USA\",\"r\":\"AZ\"},{\"a\":\"UY\",\"c\":\"598\",\"n\":\"Uruguay\",\"r\":\"AZ\"},{\"a\":\"UZ\",\"c\":\"998\",\"n\":\"Uzbekistan\"},{\"a\":\"VU\",\"c\":\"678\",\"n\":\"Vanuatu\"},{\"a\":\"VA\",\"c\":\"379\",\"n\":\"Vatican City\"},{\"a\":\"VE\",\"c\":\"58\",\"n\":\"Venezuela\",\"r\":\"AZ\"},{\"a\":\"VN\",\"c\":\"84\",\"n\":\"Vietnam\",\"r\":\"AZ\"},{\"a\":\"WF\",\"c\":\"681\",\"n\":\"Wallis and Futuna\"},{\"a\":\"EH\",\"c\":\"212\",\"n\":\"Western Sahara\"},{\"a\":\"YE\",\"c\":\"967\",\"n\":\"Yemen\"},{\"a\":\"YU\",\"c\":\"381\",\"n\":\"Yugoslavia\"},{\"a\":\"ZR\",\"c\":\"243\",\"n\":\"Zaire\"},{\"a\":\"ZM\",\"c\":\"260\",\"n\":\"Zambia\"},{\"a\":\"ZW\",\"c\":\"263\",\"n\":\"Zimbabwe\"}]" tp_objectFromJSONString];
    }
}

/// 获取手机系统语言
+ (NSString *)getAppleLanguages {
    return [[NSLocale preferredLanguages] objectAtIndex:0];
}

/// 判断手机当前语言是否是中文（包括简体/繁体）
+ (BOOL)isChinese {
    NSString *lang = [[self getAppleLanguages] lowercaseString];
    if ([lang hasPrefix:[@"zh-Hans" lowercaseString]] || [lang hasPrefix:[@"zh-Hant" lowercaseString]]) {
        return YES;
    }
    return NO;
}

@end


#pragma mark - 国家模型

@implementation MCCountryItem

@end


#pragma mark - NSJSONSerialization Category

@implementation NSString (TPJSONKit)

- (id)tp_objectFromJSONString {
    return [self tp_objectFromJSONString:NSJSONReadingAllowFragments error:NULL];
}

- (id)tp_objectFromJSONString:(NSJSONReadingOptions)serializeOptions error:(NSError **)error {
    NSData *jsonData = [self dataUsingEncoding:NSUTF8StringEncoding];
    id jsonObj = [NSJSONSerialization JSONObjectWithData:jsonData options:serializeOptions error:error];
    return jsonObj;
}

@end
